**`nomis-production`** terraform plan on `pull_request` event [#3348](https://github.com/ministryofjustice/modernisation-platform-environments/actions/runs/4255800687)

```
Terraform will perform the following actions:

  # data.aws_iam_policy_document.cloud_watch_custom will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cloud_watch_custom" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
              + "ec2:DescribeTags",
              + "ec2:DescribeVolumes",
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "CloudWatchAgentServerPolicy"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
            ]
          + effect    = "Deny"
          + resources = [
              + "*",
            ]
          + sid       = "DenyCreateLogGroups"
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:eu-west-2:272983201692:parameter/cloud-watch-config-linux",
              + "arn:aws:ssm:eu-west-2:272983201692:parameter/cloud-watch-config-windows",
            ]
          + sid       = "AccessCloudWatchConfigParameter"
        }
    }

  # data.aws_iam_policy_document.ec2_common_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ec2_common_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ssmmessages:OpenDataChannel",
                              + "ssmmessages:OpenControlChannel",
                              + "ssmmessages:CreateDataChannel",
                              + "ssmmessages:CreateControlChannel",
                              + "ssm:UpdateInstanceInformation",
                              + "ssm:UpdateInstanceAssociationStatus",
                              + "ssm:UpdateAssociationStatus",
                              + "ssm:PutInventory",
                              + "ssm:PutConfigurePackageResult",
                              + "ssm:PutComplianceItems",
                              + "ssm:ListInstanceAssociations",
                              + "ssm:ListAssociations",
                              + "ssm:GetParameters",
                              + "ssm:GetParameter",
                              + "ssm:GetManifest",
                              + "ssm:GetDocument",
                              + "ssm:GetDeployablePatchSnapshotForInstance",
                              + "ssm:DescribeDocument",
                              + "ssm:DescribeAssociation",
                              + "ec2messages:SendReply",
                              + "ec2messages:GetMessages",
                              + "ec2messages:GetEndpoint",
                              + "ec2messages:FailMessage",
                              + "ec2messages:DeleteMessage",
                              + "ec2messages:AcknowledgeMessage",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "CustomSsmPolicy"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:ListAllMyBuckets",
                              + "s3:GetBucketLocation",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:s3:::*"
                          + Sid      = "AllowOracleSecureWebListBucketandGetLocation"
                        },
                      + {
                          + Action   = [
                              + "s3:PutObject",
                              + "s3:ListBucket",
                              + "s3:GetObject",
                              + "s3:DeleteObject",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::s3-bucket20220427111226925000000002/*",
                              + "arn:aws:s3:::s3-bucket20220427111226925000000002",
                            ]
                          + Sid      = "AccessToInstallationArtefactBucket"
                        },
                      + {
                          + Action   = [
                              + "s3:PutObjectAcl",
                              + "s3:PutObject",
                              + "s3:ListBucket",
                              + "s3:GetObject",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::nomis-audit-archives20220812094555208800000001/*",
                              + "arn:aws:s3:::nomis-audit-archives20220812094555208800000001",
                            ]
                          + Sid      = "AccessToAuditAchiveBucket"
                        },
                      + {
                          + Action   = [
                              + "s3:PutObjectAcl",
                              + "s3:PutObject",
                              + "s3:ListBucket",
                              + "s3:GetObject",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::ec2-image-builder-nomis*/*",
                              + "arn:aws:s3:::ec2-image-builder-nomis*",
                            ]
                          + Sid      = "AccessToImageBuilderBucket"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "kms:RevokeGrant",
                              + "kms:ReEncrypt*",
                              + "kms:ListGrants",
                              + "kms:GenerateDataKey*",
                              + "kms:Encrypt",
                              + "kms:DescribeKey",
                              + "kms:Decrypt",
                              + "kms:CreateGrant",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:kms:eu-west-2:374269020027:key/90121e65-c5fa-43a9-8075-6f3410d2a025",
                              + "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691",
                            ]
                          + Sid      = "AllowBusinessUnitSharedKmsKeys"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "resource-groups:UpdateGroup",
                              + "resource-groups:ListGroups",
                              + "resource-groups:CreateGroups",
                              + "iam:ListRoles",
                              + "iam:CreateServiceLinkedRole",
                              + "applicationinsights:*",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "AllowApplicationInsights"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # aws_cloudwatch_metric_alarm.cert_expires_in_2_days must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "cert_expires_in_2_days" {
      ~ alarm_name                            = "cert_expires_in_2_days" -> "cert-expires-in-2-days" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:cert_expires_in_2_days" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "cert_expires_in_2_days" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      ~ namespace                             = "AWS/ACM" -> "AWS/CertificateManager"
      - ok_actions                            = [] -> null
      - tags                                  = {
          - "Name" = "cert_expires_in_2_days"
        } -> null
      ~ tags_all                              = {
          - "Name" = "cert_expires_in_2_days"
        } -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.cert_expires_in_30_days must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "cert_expires_in_30_days" {
      ~ alarm_name                            = "cert_expires_in_30_days" -> "cert-expires-in-30-days" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:cert_expires_in_30_days" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "cert_expires_in_30_days" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      ~ namespace                             = "AWS/ACM" -> "AWS/CertificateManager"
      - ok_actions                            = [] -> null
      - tags                                  = {
          - "Name" = "cert_expires_in_30_days"
        } -> null
      ~ tags_all                              = {
          - "Name" = "cert_expires_in_30_days"
        } -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.cpu_usage_iowait will be destroyed
  # (because aws_cloudwatch_metric_alarm.cpu_usage_iowait is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "cpu_usage_iowait" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ] -> null
      - alarm_description         = "This metric monitors the amount of CPU time spent waiting for I/O to complete. If the average CPU time spent waiting for I/O to complete is greater than 90% for 30 minutes, the alarm will trigger." -> null
      - alarm_name                = "cpu_usage_iowait" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:cpu_usage_iowait" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 5 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 6 -> null
      - id                        = "cpu_usage_iowait" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "cpu_usage_iowait" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {
          - "Name" = "cpu_usage_iowait"
        } -> null
      - tags_all                  = {
          - "Name" = "cpu_usage_iowait"
        } -> null
      - threshold                 = 90 -> null
      - treat_missing_data        = "missing" -> null
    }

  # aws_cloudwatch_metric_alarm.disk_free will be destroyed
  # (because aws_cloudwatch_metric_alarm.disk_free is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "disk_free" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ] -> null
      - alarm_description         = "This metric monitors the amount of free disk space on the instance. If the amount of free disk space falls below 15% for 2 minutes, the alarm will trigger: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4289822860/Disk+Free+alarm+-+Linux" -> null
      - alarm_name                = "disk_free" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:disk_free" -> null
      - comparison_operator       = "LessThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 2 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 2 -> null
      - id                        = "disk_free" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "disk_free" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {
          - "Name" = "disk_free"
        } -> null
      - tags_all                  = {
          - "Name" = "disk_free"
        } -> null
      - threshold                 = 15 -> null
      - treat_missing_data        = "missing" -> null
    }

  # aws_cloudwatch_metric_alarm.disk_free_windows will be destroyed
  # (because aws_cloudwatch_metric_alarm.disk_free_windows is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "disk_free_windows" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ] -> null
      - alarm_description         = "This metric monitors the amount of free disk space on the instance. If the amount of free disk space falls below 15% for 2 minutes, the alarm will trigger: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4305453159/Disk+Free+alarm+-+Windows" -> null
      - alarm_name                = "disk_free_windows" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:disk_free_windows" -> null
      - comparison_operator       = "LessThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 2 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 2 -> null
      - id                        = "disk_free_windows" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "DISK_FREE" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {
          - "Name" = "disk_free_windows"
        } -> null
      - tags_all                  = {
          - "Name" = "disk_free_windows"
        } -> null
      - threshold                 = 15 -> null
      - treat_missing_data        = "missing" -> null
    }

  # aws_cloudwatch_metric_alarm.high_cpu_windows will be destroyed
  # (because aws_cloudwatch_metric_alarm.high_cpu_windows is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "high_cpu_windows" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ] -> null
      - alarm_description         = "This metric monitors the Processor time. If the Processor time is greater than 95% for 5 minutes, the alarm will trigger: " -> null
      - alarm_name                = "high_cpu_windows" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:high_cpu_windows" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 5 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 5 -> null
      - id                        = "high_cpu_windows" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "PROCESSOR_TIME" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {
          - "Name" = "high_cpu_windows"
        } -> null
      - tags_all                  = {
          - "Name" = "high_cpu_windows"
        } -> null
      - threshold                 = 95 -> null
      - treat_missing_data        = "missing" -> null
    }

  # aws_cloudwatch_metric_alarm.instance_health_check will be destroyed
  # (because aws_cloudwatch_metric_alarm.instance_health_check is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "instance_health_check" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ] -> null
      - alarm_description         = "Instance status checks monitor the software and network configuration of your individual instance. When an instance status check fails, you typically must address the problem yourself: https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/monitoring-system-instance-status-check.html" -> null
      - alarm_name                = "instance_health_check_failed" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:instance_health_check_failed" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 3 -> null
      - id                        = "instance_health_check_failed" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "StatusCheckFailed_Instance" -> null
      - namespace                 = "AWS/EC2" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {
          - "Name" = "instance_health_check"
        } -> null
      - tags_all                  = {
          - "Name" = "instance_health_check"
        } -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "missing" -> null
    }

  # aws_cloudwatch_metric_alarm.load_balancer_unhealthy_state_dns must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "load_balancer_unhealthy_state_dns" {
      ~ alarm_name                            = "load_balancer_unhealthy_state_dns" -> "load-balancer-unhealthy-state-dns" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:load_balancer_unhealthy_state_dns" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "load_balancer_unhealthy_state_dns" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {
          - "Name" = "load_balancer_unhealthy_state_dns"
        } -> null
      ~ tags_all                              = {
          - "Name" = "load_balancer_unhealthy_state_dns"
        } -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.load_balancer_unhealthy_state_routing must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "load_balancer_unhealthy_state_routing" {
      ~ alarm_name                            = "load_balancer_unhealthy_state_routing" -> "load-balancer-unhealthy-state-routing" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:load_balancer_unhealthy_state_routing" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "load_balancer_unhealthy_state_routing" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {
          - "Name" = "load_balancer_unhealthy_state_routing"
        } -> null
      ~ tags_all                              = {
          - "Name" = "load_balancer_unhealthy_state_routing"
        } -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.load_balancer_unhealthy_state_target must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "load_balancer_unhealthy_state_target" {
      ~ alarm_name                            = "load_balancer_unhealthy_state_target" -> "load-balancer-unhealthy-state-target" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:load_balancer_unhealthy_state_target" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "load_balancer_unhealthy_state_target" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {
          - "Name" = "load_balancer_unhealthy_state_target"
        } -> null
      ~ tags_all                              = {
          - "Name" = "load_balancer_unhealthy_state_target"
        } -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.low_available_memory will be destroyed
  # (because aws_cloudwatch_metric_alarm.low_available_memory is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "low_available_memory" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ] -> null
      - alarm_description         = "This metric monitors the amount of available memory. If the amount of available memory is less than 10% for 2 minutes, the alarm will trigger." -> null
      - alarm_name                = "low_available_memory" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:low_available_memory" -> null
      - comparison_operator       = "LessThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 2 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 2 -> null
      - id                        = "low_available_memory" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "mem_available_percent" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {
          - "Name" = "low_available_memory"
        } -> null
      - tags_all                  = {
          - "Name" = "low_available_memory"
        } -> null
      - threshold                 = 10 -> null
      - treat_missing_data        = "missing" -> null
    }

  # aws_cloudwatch_metric_alarm.low_available_memory_windows will be destroyed
  # (because aws_cloudwatch_metric_alarm.low_available_memory_windows is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "low_available_memory_windows" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ] -> null
      - alarm_description         = "This metric monitors the amount of available memory. If Committed Bytes in Use is > 80% for 2 minutes, the alarm will trigger." -> null
      - alarm_name                = "low_available_memory_windows" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:low_available_memory_windows" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 2 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 2 -> null
      - id                        = "low_available_memory_windows" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "Memory % Committed Bytes In Use" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {
          - "Name" = "low_available_memory_windows"
        } -> null
      - tags_all                  = {
          - "Name" = "low_available_memory_windows"
        } -> null
      - threshold                 = 80 -> null
      - treat_missing_data        = "missing" -> null
    }

  # aws_cloudwatch_metric_alarm.oracle_batch_error will be destroyed
  # (because aws_cloudwatch_metric_alarm.oracle_batch_error is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "oracle_batch_error" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ] -> null
      - alarm_description         = "Oracle db is either in long-running batch or failed batch status. See: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4295000327/Oracle+Batch+alert for remediation steps." -> null
      - alarm_name                = "oracle_batch_error" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:oracle_batch_error" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 5 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 5 -> null
      - id                        = "oracle_batch_error" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "collectd_exec-batch_error" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {
          - "Name" = "oracle_batch_error"
        } -> null
      - tags_all                  = {
          - "Name" = "oracle_batch_error"
        } -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "missing" -> null
    }

  # aws_cloudwatch_metric_alarm.oracle_db_disconnected will be destroyed
  # (because aws_cloudwatch_metric_alarm.oracle_db_disconnected is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "oracle_db_disconnected" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ] -> null
      - alarm_description         = "Oracle db connection to a particular SID is not working. See: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4294246698/Oracle+db+connection+alarm for remediation steps." -> null
      - alarm_name                = "oracle_db_disconnected" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:oracle_db_disconnected" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 5 -> null
      - dimensions                = {
          - "instance" = "db_connected"
        } -> null
      - evaluation_periods        = 5 -> null
      - id                        = "oracle_db_disconnected" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "collectd_exec_value" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {
          - "Name" = "oracle_db_disconnected"
        } -> null
      - tags_all                  = {
          - "Name" = "oracle_db_disconnected"
        } -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "missing" -> null
    }

  # aws_cloudwatch_metric_alarm.system_health_check will be destroyed
  # (because aws_cloudwatch_metric_alarm.system_health_check is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "system_health_check" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:272983201692:nomis_alarms",
        ] -> null
      - alarm_description         = "System status checks monitor the AWS systems on which your instance runs. These checks detect underlying problems with your instance that require AWS involvement to repair: https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/monitoring-system-instance-status-check.html" -> null
      - alarm_name                = "system_health_check_failed" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:272983201692:alarm:system_health_check_failed" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 3 -> null
      - id                        = "system_health_check_failed" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "StatusCheckFailed_System" -> null
      - namespace                 = "AWS/EC2" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {
          - "Name" = "system_health_check"
        } -> null
      - tags_all                  = {
          - "Name" = "system_health_check"
        } -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "missing" -> null
    }

  # aws_iam_policy.ec2_bastion_policy will be updated in-place
  ~ resource "aws_iam_policy" "ec2_bastion_policy" {
        id          = "arn:aws:iam::272983201692:policy/ec2-nomis-bastion-policy"
        name        = "ec2-nomis-bastion-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                          - "ec2:DescribeVolumes",
                          - "ec2:DescribeTags",
                          - "cloudwatch:PutMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "CloudWatchAgentServerPolicy"
                    },
                  - {
                      - Action   = "logs:CreateLogGroup"
                      - Effect   = "Deny"
                      - Resource = "*"
                      - Sid      = "DenyCreateLogGroups"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:eu-west-2:272983201692:parameter/cloud-watch-config-windows",
                          - "arn:aws:ssm:eu-west-2:272983201692:parameter/cloud-watch-config-linux",
                        ]
                      - Sid      = "AccessCloudWatchConfigParameter"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {
            "Name"                   = "ec2-nomis-bastion-policy"
            "application"            = "nomis"
            "business-unit"          = "HMPPS"
            "environment-name"       = "nomis-production"
            "infrastructure-support" = "digital-studio-operations-team@digital.justice.gov.uk"
            "is-production"          = "true"
            "owner"                  = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"            = "https://github.com/ministryofjustice/modernisation-platform-environments"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.ec2_common_policy will be updated in-place
  ~ resource "aws_iam_policy" "ec2_common_policy" {
        id          = "arn:aws:iam::272983201692:policy/ec2-common-policy"
        name        = "ec2-common-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                          - "ssm:UpdateInstanceInformation",
                          - "ssm:UpdateInstanceAssociationStatus",
                          - "ssm:UpdateAssociationStatus",
                          - "ssm:PutInventory",
                          - "ssm:PutConfigurePackageResult",
                          - "ssm:PutComplianceItems",
                          - "ssm:ListInstanceAssociations",
                          - "ssm:ListAssociations",
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                          - "ssm:GetManifest",
                          - "ssm:GetDocument",
                          - "ssm:GetDeployablePatchSnapshotForInstance",
                          - "ssm:DescribeDocument",
                          - "ssm:DescribeAssociation",
                          - "ec2messages:SendReply",
                          - "ec2messages:GetMessages",
                          - "ec2messages:GetEndpoint",
                          - "ec2messages:FailMessage",
                          - "ec2messages:DeleteMessage",
                          - "ec2messages:AcknowledgeMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "CustomSsmPolicy"
                    },
                  - {
                      - Action   = [
                          - "s3:ListAllMyBuckets",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::*"
                      - Sid      = "AllowOracleSecureWebListBucketandGetLocation"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::s3-bucket20220427111226925000000002/*",
                          - "arn:aws:s3:::s3-bucket20220427111226925000000002",
                        ]
                      - Sid      = "AccessToInstallationArtefactBucket"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::nomis-audit-archives20220812094555208800000001/*",
                          - "arn:aws:s3:::nomis-audit-archives20220812094555208800000001",
                        ]
                      - Sid      = "AccessToAuditAchiveBucket"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::ec2-image-builder-nomis*/*",
                          - "arn:aws:s3:::ec2-image-builder-nomis*",
                        ]
                      - Sid      = "AccessToImageBuilderBucket"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                          - "ec2:DescribeVolumes",
                          - "ec2:DescribeTags",
                          - "cloudwatch:PutMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "CloudWatchAgentServerPolicy"
                    },
                  - {
                      - Action   = "logs:CreateLogGroup"
                      - Effect   = "Deny"
                      - Resource = "*"
                      - Sid      = "DenyCreateLogGroups"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:eu-west-2:272983201692:parameter/cloud-watch-config-windows",
                          - "arn:aws:ssm:eu-west-2:272983201692:parameter/cloud-watch-config-linux",
                        ]
                      - Sid      = "AccessCloudWatchConfigParameter"
                    },
                  - {
                      - Action   = [
                          - "kms:RevokeGrant",
                          - "kms:ReEncrypt*",
                          - "kms:ListGrants",
                          - "kms:GenerateDataKey*",
                          - "kms:Encrypt",
                          - "kms:DescribeKey",
                          - "kms:Decrypt",
                          - "kms:CreateGrant",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:kms:eu-west-2:374269020027:key/90121e65-c5fa-43a9-8075-6f3410d2a025",
                          - "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691",
                        ]
                      - Sid      = "AllowBusinessUnitSharedKmsKeys"
                    },
                  - {
                      - Action   = [
                          - "resource-groups:UpdateGroup",
                          - "resource-groups:ListGroups",
                          - "resource-groups:CreateGroups",
                          - "iam:ListRoles",
                          - "iam:CreateServiceLinkedRole",
                          - "applicationinsights:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AllowApplicationInsights"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {
            "Name"                   = "ec2-common-policy"
            "application"            = "nomis"
            "business-unit"          = "HMPPS"
            "environment-name"       = "nomis-production"
            "infrastructure-support" = "digital-studio-operations-team@digital.justice.gov.uk"
            "is-production"          = "true"
            "owner"                  = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"            = "https://github.com/ministryofjustice/modernisation-platform-environments"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_ssm_parameter.cloud_watch_config_windows will be updated in-place
  ~ resource "aws_ssm_parameter" "cloud_watch_config_windows" {
        id             = "cloud-watch-config-windows"
      + insecure_value = (known after apply)
        name           = "cloud-watch-config-windows"
        tags           = {
            "Name"                   = "cloud-watch-config-windows"
            "application"            = "nomis"
            "business-unit"          = "HMPPS"
            "environment-name"       = "nomis-production"
            "infrastructure-support" = "digital-studio-operations-team@digital.justice.gov.uk"
            "is-production"          = "true"
            "owner"                  = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"            = "https://github.com/ministryofjustice/modernisation-platform-environments"
        }
      ~ value          = (sensitive value)
      ~ version        = 4 -> (known after apply)
        # (6 unchanged attribut
```
** Truncated output.  See https://github.com/ministryofjustice/modernisation-platform-environments/actions/runs/4255800687 for the rest **
